In [5]:
import numpy as np
import pandas as pd

In [2]:
# concat

In [3]:
# https://pandas.pydata.org/docs/user_guide/merging.html

In [6]:
a = pd.read_csv('a.csv')

In [7]:
a

    A   B
0  10  20
1  30  40

In [8]:
b = pd.read_csv('b.csv')

In [9]:
b

    A   C
0  10  20
1  30  40

In [11]:
pd.concat([a,b])

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [15]:
pd.concat([a,b],axis=0)

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [17]:
data = pd.concat([a,b],axis=1)

In [18]:
data

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [19]:
data.iloc[:,1:3]

    B   A
0  20  10
1  40  30

In [20]:
data.loc[0:3]

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [21]:
# JOIN

In [22]:
pd.concat([a,b],axis=1)

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [23]:
pd.concat([a,b],join='outer')

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [24]:
# MERGE

In [25]:
a

    A   B
0  10  20
1  30  40

In [26]:
b

    A   C
0  10  20
1  30  40

In [27]:
pd.merge(a,b)

    A   B   C
0  10  20  20
1  30  40  40

In [28]:
pd.merge(b,a) #sequence changes

    A   C   B
0  10  20  20
1  30  40  40

In [29]:
a.merge(b) #same as pd.merge(a,b)

    A   B   C
0  10  20  20
1  30  40  40

In [30]:
b.merge(a) #same as pd.merge(b,a)

    A   C   B
0  10  20  20
1  30  40  40

In [ ]:
# 'MERGING' IS BEST